{
  "backend/main.mo": "Entry point for the Motoko backend actor that includes blob storage functionality via a mixin.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features (phone number updates and years-of-experience changes) to their affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, serving as a reference for the project's component structure.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH CSS custom properties for light and dark color themes including backgrounds, borders, and chart colors.",
  "frontend/index.html": "Minimal HTML shell for the React app with a root div and a module script tag pointing to main.tsx, titled 'Mahakal Electricals'.",
  "frontend/src/App.tsx": "Root React component that assembles all page sections (Navbar, Hero, About, Brands, Products, Services, Contact, Footer, WhatsApp button) into a single-page layout.",
  "frontend/src/components/AboutSection.tsx": "About section displaying shop image, owner names, address, a '2+ Years of Experience' badge, and a highlights checklist in a two-column layout.",
  "frontend/src/components/BrandsSection.tsx": "Responsive grid showcasing 12 electrical brand tiles with emoji icons and brand-specific colors, featuring gold-border hover effects.",
  "frontend/src/components/ContactSection.tsx": "Contact section with shop address, two clickable tel: phone numbers (9630232599 and 9179142549), a WhatsApp link, business hours, and a local enquiry form with success feedback.",
  "frontend/src/components/Footer.tsx": "Dark navy footer with brand info, quick navigation links, both updated phone numbers as clickable tel: links, a WhatsApp link, copyright notice, and a caffeine.ai attribution.",
  "frontend/src/components/HeroSection.tsx": "Renders the hero banner section with a background image, overlay, headline, CTA buttons for scrolling to products/contact, and a stats row showing brands, products, and experience.",
  "frontend/src/components/Navbar.tsx": "Sticky navigation bar with logo, desktop nav links, a contact button, and a responsive mobile hamburger menu with smooth-scroll behavior.",
  "frontend/src/components/ProductsSection.tsx": "Displays a categorized product catalog (fans, lights, switches, wires, MCBs, inverters) with brand names, product names, descriptions, and icons organized in a grid layout.",
  "frontend/src/components/ServicesSection.tsx": "Renders a grid of six electrical service cards (wiring, fan repair, MCB repair, inverter service, industrial wiring, home automation) with icons, titles, and descriptions.",
  "frontend/src/components/WhatsAppButton.tsx": "Fixed floating WhatsApp chat button linking to a pre-filled WhatsApp message for the store's phone number.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, identity persistence, and login status states.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file with no active queries, reserved for future backend integrations on this static website.",
  "frontend/src/index.css": "Global CSS file that imports Poppins font, sets up Tailwind directives, and defines CSS custom properties for a navy/gold brand palette along with utility classes for colors, shadows, and section padding.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with Poppins font, navy/gold/whatsapp brand colors mapped to oklch CSS variables, custom shadows, border radii, and animation keyframes, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Project state manifest (version 5) describing the Mahakal Electricals single-page website, including its architectural notes, existing feature list with IDs, known issues, and product/brand catalog structure."
}